# handle missing value

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("weather_data_2.csv")
print(df)

        day temperature windspeed     event
0  1/1/2017         32C      6mph      Rain
1  1/2/2017      -99999         7     Sunny
2  1/3/2017          28    -99999      Snow
3  1/4/2017      -99999     7kmph  no event
4  1/5/2017         32F    -99999      Rain
5  1/6/2017          31         2     Sunny
6  1/6/2017          34         5  no event

#### -99999 is special value means the value is missing

In [3]:
new_df = df.replace(-99999,np.nan)
new_df

        day temperature windspeed     event
0  1/1/2017         32C      6mph      Rain
1  1/2/2017      -99999         7     Sunny
2  1/3/2017          28    -99999      Snow
3  1/4/2017      -99999     7kmph  no event
4  1/5/2017         32F    -99999      Rain
5  1/6/2017          31         2     Sunny
6  1/6/2017          34         5  no event

### pandas does have its own missing-value types — but np.nan is still widely used. in pandas pd.NaT , pd.Na

In [4]:
new_df = df.replace(-99999,pd.NA)
new_df

        day temperature windspeed     event
0  1/1/2017         32C      6mph      Rain
1  1/2/2017      -99999         7     Sunny
2  1/3/2017          28    -99999      Snow
3  1/4/2017      -99999     7kmph  no event
4  1/5/2017         32F    -99999      Rain
5  1/6/2017          31         2     Sunny
6  1/6/2017          34         5  no event

### df.fillna(0) returns a DataFrame.

### want to replace 2 special values ..use list inside the replace()

##### change to the original csv file to get new special value

In [5]:
df = pd.read_csv("weather_data_2.csv")
print(df)

        day temperature windspeed     event
0  1/1/2017         32C      6mph      Rain
1  1/2/2017      -99999         7     Sunny
2  1/3/2017          28    -99999      Snow
3  1/4/2017      -99999     7kmph  no event
4  1/5/2017         32F    -99999      Rain
5  1/6/2017          31         2     Sunny
6  1/6/2017          34         5  no event

In [6]:
new_df = df.replace([-99999,-88888],np.nan)
new_df

        day temperature windspeed     event
0  1/1/2017         32C      6mph      Rain
1  1/2/2017      -99999         7     Sunny
2  1/3/2017          28    -99999      Snow
3  1/4/2017      -99999     7kmph  no event
4  1/5/2017         32F    -99999      Rain
5  1/6/2017          31         2     Sunny
6  1/6/2017          34         5  no event

##### replace specific column's special value

In [7]:
df = pd.read_csv("weather_data_2.csv")
df

        day temperature windspeed     event
0  1/1/2017         32C      6mph      Rain
1  1/2/2017      -99999         7     Sunny
2  1/3/2017          28    -99999      Snow
3  1/4/2017      -99999     7kmph  no event
4  1/5/2017         32F    -99999      Rain
5  1/6/2017          31         2     Sunny
6  1/6/2017          34         5  no event

In [8]:
print(df.dtypes)
print(df.columns)

day            object
temperature    object
windspeed      object
event          object
dtype: object
Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [9]:
new_df = df.replace({
    'temperature': [-99999, -88888],
    'windspeed':   [-99999, -88888],
    'event':       ["0",0]
}, np.nan)
new_df
# as from previous cell we know the event is ibject so it will have "0" not 0 so we use both 
#'event':       ["0",0]

        day temperature windspeed     event
0  1/1/2017         32C      6mph      Rain
1  1/2/2017      -99999         7     Sunny
2  1/3/2017          28    -99999      Snow
3  1/4/2017      -99999     7kmph  no event
4  1/5/2017         32F    -99999      Rain
5  1/6/2017          31         2     Sunny
6  1/6/2017          34         5  no event

In [10]:
df = pd.read_csv("weather_data_2.csv")
df

        day temperature windspeed     event
0  1/1/2017         32C      6mph      Rain
1  1/2/2017      -99999         7     Sunny
2  1/3/2017          28    -99999      Snow
3  1/4/2017      -99999     7kmph  no event
4  1/5/2017         32F    -99999      Rain
5  1/6/2017          31         2     Sunny
6  1/6/2017          34         5  no event

##### map -99999 -> np.nan and no event -> sunny

In [11]:
new_df = df.replace({-99999:np.nan,'no event':'sunny'})
new_df

        day temperature windspeed  event
0  1/1/2017         32C      6mph   Rain
1  1/2/2017      -99999         7  Sunny
2  1/3/2017          28    -99999   Snow
3  1/4/2017      -99999     7kmph  sunny
4  1/5/2017         32F    -99999   Rain
5  1/6/2017          31         2  Sunny
6  1/6/2017          34         5  sunny

### if the any column have any type of mixed data like 32C and 32F or wind speed 6mph or 7kmph etc

In [12]:
df = pd.read_csv("weather_data_2.csv")
df

        day temperature windspeed     event
0  1/1/2017         32C      6mph      Rain
1  1/2/2017      -99999         7     Sunny
2  1/3/2017          28    -99999      Snow
3  1/4/2017      -99999     7kmph  no event
4  1/5/2017         32F    -99999      Rain
5  1/6/2017          31         2     Sunny
6  1/6/2017          34         5  no event

In [13]:

new_df = df.replace({
    'temperature': r'[A-Za-z]+',
    'windspeed': r'[A-Za-z]+'
}, np.nan, regex=True)
new_df

        day temperature windspeed     event
0  1/1/2017         NaN       NaN      Rain
1  1/2/2017      -99999         7     Sunny
2  1/3/2017          28    -99999      Snow
3  1/4/2017      -99999       NaN  no event
4  1/5/2017         NaN    -99999      Rain
5  1/6/2017          31         2     Sunny
6  1/6/2017          34         5  no event

Here is a short 5–6 line explanation of these regex patterns:

* `'temperature': r'[A-Za-z]+'` and `'windspeed': r'[A-Za-z]+'` are **regular-expression rules** used in `df.replace()` to identify alphabet characters in the given columns.
* The pattern `[A–Z a–z]` matches **any uppercase or lowercase letter**.
* The `+` at the end means **one or more letters in sequence** (e.g., `C`, `mph`, `abc`, etc.).
* This allows pandas to detect **words or alphabetic units** inside numeric fields like `"30C"` or `"12mph"`.
* When used with `regex=True`, pandas can **search inside the text**, not just for exact matches.
* These matched alphabetic parts can then be **replaced with `np.nan` or blank** during data cleaning.

# important

### replace a list of values with the another list of values

##### create new short data frame for better convinient

In [14]:
df = pd.DataFrame({
    'score': ['exceptional', 'average', 'good', 'poor', 'average', 'exceptional'],
    'student': ['rob', 'maya', 'parthiv', 'tom', 'julian', 'erica']
})
df

         score  student
0  exceptional      rob
1      average     maya
2         good  parthiv
3         poor      tom
4      average   julian
5  exceptional    erica

In [15]:
new_df = df.replace(['poor','good','average'],[0,2,1])
new_df

         score  student
0  exceptional      rob
1            1     maya
2            2  parthiv
3            0      tom
4            1   julian
5  exceptional    erica